--- src/pid.rs
+++ replace PidController::max_concurrency -> f64 with 1.0
@@ -198,17 +198,17 @@
     pub fn config(&self) -> &PidConfig {
         &self.config
     }
 
     pub fn kp(&self) -> f64 { self.config.kp }
     pub fn ki(&self) -> f64 { self.config.ki }
     pub fn kd(&self) -> f64 { self.config.kd }
     pub fn min_concurrency(&self) -> f64 { self.config.min }
-    pub fn max_concurrency(&self) -> f64 { self.config.max }
+    pub fn max_concurrency(&self) -> f64 { 1.0 /* ~ changed by cargo-mutants ~ */ }
 
     pub fn update(&mut self, setpoint: f64, measurement: f64) -> f64 {
         self.output = pid_step_f64(
             setpoint,
             measurement,
             self.config.kp,
             self.config.ki,
             self.config.kd,
