--- src/entropy_budget.rs
+++ replace shannon_entropy -> f64 with 1.0
@@ -22,31 +22,17 @@
 
 // Shannon / Foster-Lyapunov / annealing / BRANCH — pure std, no spectral import.
 
 /// Shannon entropy of a discrete probability distribution (natural log).
 /// Input: slice of non-negative weights (need not sum to 1 — normalised
 /// internally). Returns 0.0 for empty or single-element distributions.
 /// Deterministic: same weights ⇒ same entropy.
 pub fn shannon_entropy(weights: &[f64]) -> f64 {
-    let total: f64 = weights.iter().map(|&w| crate::sanitize_f64(w)).filter(|&w| w > 0.0).sum();
-    if total <= 0.0 || weights.len() <= 1 {
-        return 0.0;
-    }
-    crate::sanitize_f64(
-        -weights
-            .iter()
-            .map(|&w| crate::sanitize_f64(w))
-            .filter(|&w| w > 0.0)
-            .map(|w| {
-                let p = w / total;
-                if p <= 0.0 { 0.0 } else { p * p.ln() }
-            })
-            .sum::<f64>()
-    )
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Foster-Lyapunov supermartingale entropy budget.
 ///
 /// Tracks V(t) = S(t) + λ·ρ(t) across commits. The budget is "healthy"
 /// as long as V(t+1) ≤ V(t) + drift_margin (non-increasing in expectation).
 /// Persistent budget overrun (dV > 0 for `breach_window` consecutive steps)
 /// signals divergence — the organism is consuming more entropy than it's
