--- src/entropy_budget.rs
+++ replace > with == in shannon_entropy
@@ -22,17 +22,17 @@
 
 // Shannon / Foster-Lyapunov / annealing / BRANCH — pure std, no spectral import.
 
 /// Shannon entropy of a discrete probability distribution (natural log).
 /// Input: slice of non-negative weights (need not sum to 1 — normalised
 /// internally). Returns 0.0 for empty or single-element distributions.
 /// Deterministic: same weights ⇒ same entropy.
 pub fn shannon_entropy(weights: &[f64]) -> f64 {
-    let total: f64 = weights.iter().map(|&w| crate::sanitize_f64(w)).filter(|&w| w > 0.0).sum();
+    let total: f64 = weights.iter().map(|&w| crate::sanitize_f64(w)).filter(|&w| w == /* ~ changed by cargo-mutants ~ */ 0.0).sum();
     if total <= 0.0 || weights.len() <= 1 {
         return 0.0;
     }
     crate::sanitize_f64(
         -weights
             .iter()
             .map(|&w| crate::sanitize_f64(w))
             .filter(|&w| w > 0.0)
