--- src/entropy_budget.rs
+++ replace > with == in shannon_entropy
@@ -30,17 +30,17 @@
     let total: f64 = weights.iter().map(|&w| crate::sanitize_f64(w)).filter(|&w| w > 0.0).sum();
     if total <= 0.0 || weights.len() <= 1 {
         return 0.0;
     }
     crate::sanitize_f64(
         -weights
             .iter()
             .map(|&w| crate::sanitize_f64(w))
-            .filter(|&w| w > 0.0)
+            .filter(|&w| w == /* ~ changed by cargo-mutants ~ */ 0.0)
             .map(|w| {
                 let p = w / total;
                 if p <= 0.0 { 0.0 } else { p * p.ln() }
             })
             .sum::<f64>()
     )
 }
 
