--- src/pid.rs
+++ replace PidController32::config -> &PidConfig32 with Box::leak(Box::new(Default::default()))
@@ -262,17 +262,17 @@
             config,
             integral: 0.0,
             prev_error: 0.0,
             output: config.max,
         }
     }
 
     pub fn config(&self) -> &PidConfig32 {
-        &self.config
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn update(&mut self, setpoint: f32, measurement: f32) -> f32 {
         self.output = pid_step_f32(
             setpoint,
             measurement,
             self.config.kp,
             self.config.ki,
