--- src/pid.rs
+++ replace PidArray::config -> PidConfig with Default::default()
@@ -351,17 +351,17 @@
         self.n
     }
 
     pub fn is_empty(&self) -> bool {
         self.n == 0
     }
 
     pub fn config(&self) -> PidConfig {
-        PidConfig::new(self.kp, self.ki, self.kd, self.min, self.max)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn output(&self, idx: usize) -> f64 {
         if idx >= self.n {
             return self.min;
         }
         debug_assert!(idx < self.n, "PidArray::output: idx {} out of bounds (n={})", idx, self.n);
         self.outputs[idx]
