[Survived] StringLiteral
src/errors.ts:12:11
 
 export class ScaffoldDisabledError extends Error {
   constructor(readonly from: OrderStatus, readonly to: OrderStatus) {
-    super(`Scaffold transition disabled: ${from} → ${to}`);
+    super(``);
     this.name = 'ScaffoldDisabledError';
   }

[Killed] StringLiteral
src/errors.ts:20:17
 export class SameStatusError extends Error {
   constructor(readonly status: OrderStatus) {
     super(`Cannot transition to same status: ${status}`);
-    this.name = 'SameStatusError';
+    this.name = "";
   }
 }
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.1181ms)

✖ P2: same-status always throws SameStatusError (11.4585ms)

[Survived] BlockStatement
src/errors.ts:25:32
 }
 
 export class ConflictError extends Error {
-  constructor(message: string) {
-    super(message);
-    this.name = 'ConflictError';
-  }
+  constructor(message: string) {}
 }
 

[Survived] StringLiteral
src/errors.ts:27:17
 export class ConflictError extends Error {
   constructor(message: string) {
     super(message);
-    this.name = 'ConflictError';
+    this.name = "";
   }
 }
