[Killed] ObjectLiteral
src/order-machine.ts:18:70
 
 export type OrderStatus = (typeof ORDER_STATUSES)[number];
 
-const TRANSITIONS: Record<OrderStatus, ReadonlyArray<OrderStatus>> = {
-  PENDING: ['CONFIRMED', 'REJECTED', 'CANCELLED'],
-  CONFIRMED: ['PREPARING', 'IN_DELIVERY'],
-  PREPARING: ['READY'],
-  READY: ['IN_DELIVERY'],
-  IN_DELIVERY: ['DELIVERED'],
-  DELIVERED: [],
-  REJECTED: [],
-  CANCELLED: [],
-  SCHEDULED: [],
-  PICKED_UP: [],
-};
+const TRANSITIONS: Record<OrderStatus, ReadonlyArray<OrderStatus>> = {};
 
 const SCAFFOLD_STATUSES: ReadonlySet<OrderStatus> = new Set(['SCHEDULED', 'PICKED_UP']);
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (8.1659ms)

✔ P2: same-status always throws SameStatusError (7.5591ms)

[Killed] StringLiteral
src/order-machine.ts:19:13
 export type OrderStatus = (typeof ORDER_STATUSES)[number];
 
 const TRANSITIONS: Record<OrderStatus, ReadonlyArray<OrderStatus>> = {
-  PENDING: ['CONFIRMED', 'REJECTED', 'CANCELLED'],
+  PENDING: ["", 'REJECTED', 'CANCELLED'],
   CONFIRMED: ['PREPARING', 'IN_DELIVERY'],
   PREPARING: ['READY'],
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (6.0717ms)

✔ P2: same-status always throws SameStatusError (7.2699ms)
✔ P3: terminal statuses have no outgoing transitions (3.264ms)

[Killed] StringLiteral
src/order-machine.ts:20:28
 
 const TRANSITIONS: Record<OrderStatus, ReadonlyArray<OrderStatus>> = {
   PENDING: ['CONFIRMED', 'REJECTED', 'CANCELLED'],
-  CONFIRMED: ['PREPARING', 'IN_DELIVERY'],
+  CONFIRMED: ['PREPARING', ""],
   PREPARING: ['READY'],
   READY: ['IN_DELIVERY'],
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (6.0986ms)

✔ P2: same-status always throws SameStatusError (27.5038ms)

[Killed] ArrayDeclaration
src/order-machine.ts:21:14
 const TRANSITIONS: Record<OrderStatus, ReadonlyArray<OrderStatus>> = {
   PENDING: ['CONFIRMED', 'REJECTED', 'CANCELLED'],
   CONFIRMED: ['PREPARING', 'IN_DELIVERY'],
-  PREPARING: ['READY'],
+  PREPARING: [],
   READY: ['IN_DELIVERY'],
   IN_DELIVERY: ['DELIVERED'],
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (6.125ms)

✔ P2: same-status always throws SameStatusError (6.6064ms)

[Survived] ArrayDeclaration
src/order-machine.ts:28:14
   REJECTED: [],
   CANCELLED: [],
   SCHEDULED: [],
-  PICKED_UP: [],
+  PICKED_UP: ["Stryker was here"],
 };
 

[Killed] BlockStatement
src/order-machine.ts:33:76
 
 const SCAFFOLD_STATUSES: ReadonlySet<OrderStatus> = new Set(['SCHEDULED', 'PICKED_UP']);
 
-export function assertTransition(from: OrderStatus, to: OrderStatus): void {
-  if (from === to) throw new SameStatusError(from);
-  if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
-  if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
-
-  const allowed = TRANSITIONS[from];
-  if (!allowed || !allowed.includes(to)) throw new IllegalTransitionError(from, to);
-}
+export function assertTransition(from: OrderStatus, to: OrderStatus): void {}
 
 export function isTerminal(status: OrderStatus): boolean {
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.1584ms)

✖ P2: same-status always throws SameStatusError (12.6148ms)

[Killed] ConditionalExpression
src/order-machine.ts:34:7
 const SCAFFOLD_STATUSES: ReadonlySet<OrderStatus> = new Set(['SCHEDULED', 'PICKED_UP']);
 
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
-  if (from === to) throw new SameStatusError(from);
+  if (true) throw new SameStatusError(from);
   if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (14.5481ms)
✔ P2: same-status always throws SameStatusError (11.0935ms)
✔ P3: terminal statuses have no outgoing transitions (5.3728ms)

[Killed] ConditionalExpression
src/order-machine.ts:34:7
 const SCAFFOLD_STATUSES: ReadonlySet<OrderStatus> = new Set(['SCHEDULED', 'PICKED_UP']);
 
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
-  if (from === to) throw new SameStatusError(from);
+  if (false) throw new SameStatusError(from);
   if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.0346ms)

✖ P2: same-status always throws SameStatusError (12.0144ms)

[Killed] ConditionalExpression
src/order-machine.ts:35:7
 
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
   if (from === to) throw new SameStatusError(from);
-  if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
+  if (true) throw new ScaffoldDisabledError(from, to);
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (8.0571ms)

✔ P2: same-status always throws SameStatusError (8.4217ms)

[Killed] ConditionalExpression
src/order-machine.ts:35:7
 
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
   if (from === to) throw new SameStatusError(from);
-  if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
+  if (false) throw new ScaffoldDisabledError(from, to);
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.61ms)

✔ P2: same-status always throws SameStatusError (8.73ms)

[Killed] ConditionalExpression
src/order-machine.ts:36:7
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
   if (from === to) throw new SameStatusError(from);
   if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
-  if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
+  if (false) throw new ScaffoldDisabledError(from, to);
 
   const allowed = TRANSITIONS[from];
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.2966ms)

✔ P2: same-status always throws SameStatusError (7.3629ms)

[Killed] ConditionalExpression
src/order-machine.ts:36:7
 export function assertTransition(from: OrderStatus, to: OrderStatus): void {
   if (from === to) throw new SameStatusError(from);
   if (SCAFFOLD_STATUSES.has(to)) throw new ScaffoldDisabledError(from, to);
-  if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
+  if (true) throw new ScaffoldDisabledError(from, to);
 
   const allowed = TRANSITIONS[from];
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (13.8643ms)

✔ P2: same-status always throws SameStatusError (8.0835ms)
✔ P3: terminal statuses have no outgoing transitions (4.3321ms)

[Killed] LogicalOperator
src/order-machine.ts:39:7
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
 
   const allowed = TRANSITIONS[from];
-  if (!allowed || !allowed.includes(to)) throw new IllegalTransitionError(from, to);
+  if (!allowed && !allowed.includes(to)) throw new IllegalTransitionError(from, to);
 }
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.315ms)

✔ P2: same-status always throws SameStatusError (7.6493ms)

[Killed] ConditionalExpression
src/order-machine.ts:39:7
   if (SCAFFOLD_STATUSES.has(from)) throw new ScaffoldDisabledError(from, to);
 
   const allowed = TRANSITIONS[from];
-  if (!allowed || !allowed.includes(to)) throw new IllegalTransitionError(from, to);
+  if (true) throw new IllegalTransitionError(from, to);
 }
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✖ P1: every listed valid transition is accepted (8.3809ms)

✔ P2: same-status always throws SameStatusError (9.8301ms)
✔ P3: terminal statuses have no outgoing transitions (4.2874ms)

[Killed] BlockStatement
src/order-machine.ts:42:58
   if (!allowed || !allowed.includes(to)) throw new IllegalTransitionError(from, to);
 }
 
-export function isTerminal(status: OrderStatus): boolean {
-  return ['DELIVERED', 'REJECTED', 'CANCELLED'].includes(status);
-}
+export function isTerminal(status: OrderStatus): boolean {}
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (12.3655ms)

✔ P2: same-status always throws SameStatusError (14.507ms)

[Killed] StringLiteral
src/order-machine.ts:43:36
 }
 
 export function isTerminal(status: OrderStatus): boolean {
-  return ['DELIVERED', 'REJECTED', 'CANCELLED'].includes(status);
+  return ['DELIVERED', 'REJECTED', ""].includes(status);
 }
 
killedBy: All tests
statusReason: > @deliveryos/domain@1.0.0 test
> tsx --test src/__tests__/order-machine.prop.test.ts


✔ P1: every listed valid transition is accepted (2.2591ms)

✔ P2: same-status always throws SameStatusError (7.7305ms)
